<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
	<link href="styles.css" rel="stylesheet" type="text/css" media="all" />
	<title>Information</title>

	<body>
		<div class = "wrapper">
			<div id="top">
				<h1 class="logo"><a href="index.html">&nbspPurrposely Adorable</a></h1>
				<p style= "float:left">&nbspPurrposely Adorable</p>
				<div id = "head">
					 <ul>
						<li><a href = "survey.html"> Survey</a></li>
						<li><a class="active"  href = "info.html"> Information</a></li>
						<li><a href="about.html">About me</a></li>
						<li><a href="index.html">Home</a></li>
					</ul>
				</div>
			</div>
			<br><br><br><br><br>

			<div style = "background: url(images/table_bg.png);line-height: 200%;display:inline-block;">
				<h1><big>Tema:</big> HTML for User Agents</h1>
				<p style="float:left;width:50%;margin:0px;"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cada diferente Browser de la red tiene su propio String que lo distingue del resto, esto es conocido como el USER AGENT(UA).  
					El formato para distinguir al user agent es primero poner el nombre del programa seguido de la versi&#243;n y luego se 
					ponen detalles del browser/computadora.  Los user agents se usan en momentos que el sitio de web no puede distinguir que tipo de computadora lo est&#225; 
					accesando y le pide el user agent para poder saber.  El punto de los user agents es poder tener un script de javascript que verifique el user agent y dej&#225;ndose 
					llevar por eso reduzca o agrande el tama&#241;o de la p&#225;gina para acomodar al equipo que lo est&#233; usando.  Los user agents les hacen la vida mucho m&#225;s f&#225;cil a los 
					dise&#241;adores de sitios de web.  Es una gran ventaja porque lo &#250;nico que se tiene que hacer es tener el script con el "if" y verifique su user agent.<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Los user agents se 
					usan cuando un dise&ntilde;ador de p&aacute;ginas web desea tener p&aacute;ginas espec&iacute;ficas para ciertos equipos electr&oacute;nicos.  Los user agents son efectivos y muy &uacute;tiles a los dise&ntilde;adores 
					de p&aacute;ginas web, es necesario tener en mente que tipo de equipo electr&oacute;nico podr&aacute; acusar su p&aacute;gina.  Es m&aacute;s una medida preventiva para que el usuario tenga una experiencia agradable en 
					la p&aacute;gina suya. <br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Al poder ajustarse la p&aacute;gina dependiendo del browser que lo acceda se puede limitar muchas cosas dependiendo del equipo que lo accede o 
					simplemente se manda lo posible.  Por ejemplo, si usas una versi&oacute;n vieja de Internet Explorer y entras a una p&aacute;gina nueva que tiene objetos de HTML5, pues el User Agent le va decir al browser que no es compatible 
					y no muestra el objeto.  De la misma manera es posible hacer que algunos browsers se pongan un User Agent de otro browser para poder acceder la p&aacute;gina con todas las funciones.  Un ejemplo de esto ser&iacute;a el browser 
					de los  celulares Android que el User Agent que usa es el de Safari, el browser creado por Apple.  Es posible tambi&eacute;n tener un browser que pueda cambiar su User Agent cuando el usuario lo escoja.  Por m&aacute;s que es un 
					beneficio a el dise&ntilde;ador usar User Agent strings, el W3C lo considera una mala pr&aacute;ctica, ya que se a veces se necesita un browser espec&iacute;fico para poder disfrutar de todos lo que puede tener una p&aacute;gina web.  
					La soluci&oacute;n del W3C es usar HTML que sea est&aacute;ndar en todos los equipos/browsers posibles.  <br>
				</p>
				
				<p style="float:right;  width:50%;margin:0px;">
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Donde los User Agent strings verdaderamente demuestran su uso eficiente es con los equipos m&oacute;viles y tabletas.  Ayudan a que el momento que el usuario entre a la p&aacute;gina, se 
					decida si se usa el HTML original y si usar el HTML creado expl&iacute;citamente para los m&oacute;viles.  Hay aquellos que piensan que es m&aacute;s eficiente hacer una p&aacute;gina HTML que sea flexible con cualquier equipo o browser
					que lo vaya acceder, y por lo tanto por eso es que muchas p&aacute;ginas tienen dise&ntilde;os como para equipos con pantallas t&aacute;ctiles.
			
				</p>
			</div>
			
			
			<div class="push"></div>
		</div>	
		
		<div id = "foot">
			<p> Made by Andres A. Acevedo<br>
			 &#169;Any images used are not made by Andres and are used to demonstrate a non-profit website used for a university project.</p>
			<ul>
				<li><a class = "active" href="index.html">Home</a></li>
				<li class="space">|</li>
				<li><a href="about.html">About me</a></li>	
				<li class="space">|</li>
				<li><a href = "info.html"> Information</a></li>
				<li class="space">|</li>
				<li><a href = "survey.html"> Survey</a></li>
				<li class="space">|</li>
				<li><a href="http://validator.w3.org/check?uri=referer">xHtml</a></li>
			</ul>
		</div>
	</body>
</html>